; domain
(define (domain EMERGENCY_SERVICES_LOGISTICS)
  (:requirements :strips :typing)
  (:types
    phys_object location crate_type number container - object
    helicopter victim crate carrier - phys_object
    helicopter carrier - container
    )
  (:constants
    food_crate medicine_crate - crate_type
    depot - location


    n0 n1 n2 n3 n4 - number
    )
  (:predicates
    (at ?o - phys_object ?l - location)
    (has_crate ?v - victim ?t - crate_type)
    (contains ?h - container ?c - crate)
    (empty ?h - helicopter)
    (can_be_taken ?c - crate)
    (is_type ?c - crate ?t - crate_type)
    (nb_loaded_crates ?r - carrier ?n - number)

    (next ?numA - number ?numB - number)
    )

  (:action move
   :parameters (?h - helicopter ?from - location ?to - location)
   :precondition
   (and
    (at ?h ?from)
    )
   :effect
   (and
    (at ?h ?to)
    (not (at ?h ?from))
    )
   )

  (:action pick_up
   :parameters (?h - helicopter ?c - crate ?l - location)
   :precondition
   (and
    (at ?h ?l)
    (at ?c ?l)
    (empty ?h)
    (can_be_taken ?c))
   :effect 
   (and 
    (not
    (empty ?h))
    (not (can_be_taken ?c))
    (contains ?h ?c)
    (not (at ?c ?l))
    )
   )

  (:action give
   :parameters (?h - helicopter ?c - crate ?v - victim ?l - location ?t - crate_type)
   :precondition
   (and 
    (contains ?h ?c)
    (is_type ?c ?t)
    (at ?h ?l) (at ?v ?l)
    )
   :effect
   (and
    (empty ?h)
    (can_be_taken ?c)
    (not (contains ?h ?c))
    (has_crate ?v ?t)
    )
   )

  (:action load_crate_on_carrier
    :parameters (?h - helicopter ?r - carrier ?c - crate ?l - location ?nb_loaded - number ?new_nb_loaded - number)
    :precondition
    (and
      (at ?h ?l)
      (at ?r ?l)
      (contains ?h ?c)
      (nb_loaded_crates ?r ?nb_loaded)
      (next ?nb_loaded ?new_nb_loaded)
      )
    :effect
    (and
      (not (nb_loaded_crates ?r ?nb_loaded))
      (nb_loaded_crates ?r ?new_nb_loaded)
      (not (contains ?h ?c))
      (contains ?r ?c)
      )
    )

  (:action fly_carrier
    :parameters (?h - helicopter ?r - carrier ?from - location ?to - location)
    :precondition
    (and
      (empty ?h)
      (at ?h ?from)
      (at ?r ?from)
      )
    :effect
    (and
      (not (at ?h ?to)) (at ?h ?from)
      (not (at ?r ?to)) (at ?r ?from)
      )
    )

  (:action take_crate_from_carrier
    :parameters (?h - helicopter ?r - carrier ?c - crate ?l - location ?nb_loaded - number ?new_nb_loaded - number)
    :precondition
    (and
      (at ?h ?l)
      (at ?r ?l)
      (contains ?r ?c)
      (empty ?h)
      (nb_loaded_crates ?r ?nb_loaded)
      (next ?new_nb_loaded ?nb_loaded)
      )
    :effect
    (and
      (not (contains ?r ?c))
      (contains ?h ?c)
      (not (nb_loaded_crates ?r ?nb_loaded)) (nb_loaded_crates ?r ?new_nb_loaded)
      )
    )
  )

; problem
(define (problem helicopter_problem_1_1_10_50_40c12c28_10)
(:domain EMERGENCY_SERVICES_LOGISTICS)
(:objects
	helicopter1 - helicopter
	depot - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	loc6 - location
	loc7 - location
	loc8 - location
	loc9 - location
	loc10 - location
	crate1 - crate
	crate2 - crate
	crate3 - crate
	crate4 - crate
	crate5 - crate
	crate6 - crate
	crate7 - crate
	crate8 - crate
	crate9 - crate
	crate10 - crate
	crate11 - crate
	crate12 - crate
	crate13 - crate
	crate14 - crate
	crate15 - crate
	crate16 - crate
	crate17 - crate
	crate18 - crate
	crate19 - crate
	crate20 - crate
	crate21 - crate
	crate22 - crate
	crate23 - crate
	crate24 - crate
	crate25 - crate
	crate26 - crate
	crate27 - crate
	crate28 - crate
	crate29 - crate
	crate30 - crate
	crate31 - crate
	crate32 - crate
	crate33 - crate
	crate34 - crate
	crate35 - crate
	crate36 - crate
	crate37 - crate
	crate38 - crate
	crate39 - crate
	crate40 - crate
	food_crate - crate_type
	medicine_crate - crate_type
	person1 - victim
	person2 - victim
	person3 - victim
	person4 - victim
	person5 - victim
	person6 - victim
	person7 - victim
	person8 - victim
	person9 - victim
	person10 - victim
	person11 - victim
	person12 - victim
	person13 - victim
	person14 - victim
	person15 - victim
	person16 - victim
	person17 - victim
	person18 - victim
	person19 - victim
	person20 - victim
	person21 - victim
	person22 - victim
	person23 - victim
	person24 - victim
	person25 - victim
	person26 - victim
	person27 - victim
	person28 - victim
	person29 - victim
	person30 - victim
	person31 - victim
	person32 - victim
	person33 - victim
	person34 - victim
	person35 - victim
	person36 - victim
	person37 - victim
	person38 - victim
	person39 - victim
	person40 - victim
	person41 - victim
	person42 - victim
	person43 - victim
	person44 - victim
	person45 - victim
	person46 - victim
	person47 - victim
	person48 - victim
	person49 - victim
	person50 - victim
	carrier1 - carrier
)
(:init
	(next n0 n1)
	(next n1 n2)
	(next n2 n3)
	(next n3 n4)
	(is_type crate1 food_crate)
	(at crate1 depot)
	(can_be_taken crate1)
	(is_type crate2 food_crate)
	(at crate2 depot)
	(can_be_taken crate2)
	(is_type crate3 food_crate)
	(at crate3 depot)
	(can_be_taken crate3)
	(is_type crate4 food_crate)
	(at crate4 depot)
	(can_be_taken crate4)
	(is_type crate5 food_crate)
	(at crate5 depot)
	(can_be_taken crate5)
	(is_type crate6 food_crate)
	(at crate6 depot)
	(can_be_taken crate6)
	(is_type crate7 food_crate)
	(at crate7 depot)
	(can_be_taken crate7)
	(is_type crate8 food_crate)
	(at crate8 depot)
	(can_be_taken crate8)
	(is_type crate9 food_crate)
	(at crate9 depot)
	(can_be_taken crate9)
	(is_type crate10 food_crate)
	(at crate10 depot)
	(can_be_taken crate10)
	(is_type crate11 food_crate)
	(at crate11 depot)
	(can_be_taken crate11)
	(is_type crate12 food_crate)
	(at crate12 depot)
	(can_be_taken crate12)
	(is_type crate13 medicine_crate)
	(at crate13 depot)
	(can_be_taken crate13)
	(is_type crate14 medicine_crate)
	(at crate14 depot)
	(can_be_taken crate14)
	(is_type crate15 medicine_crate)
	(at crate15 depot)
	(can_be_taken crate15)
	(is_type crate16 medicine_crate)
	(at crate16 depot)
	(can_be_taken crate16)
	(is_type crate17 medicine_crate)
	(at crate17 depot)
	(can_be_taken crate17)
	(is_type crate18 medicine_crate)
	(at crate18 depot)
	(can_be_taken crate18)
	(is_type crate19 medicine_crate)
	(at crate19 depot)
	(can_be_taken crate19)
	(is_type crate20 medicine_crate)
	(at crate20 depot)
	(can_be_taken crate20)
	(is_type crate21 medicine_crate)
	(at crate21 depot)
	(can_be_taken crate21)
	(is_type crate22 medicine_crate)
	(at crate22 depot)
	(can_be_taken crate22)
	(is_type crate23 medicine_crate)
	(at crate23 depot)
	(can_be_taken crate23)
	(is_type crate24 medicine_crate)
	(at crate24 depot)
	(can_be_taken crate24)
	(is_type crate25 medicine_crate)
	(at crate25 depot)
	(can_be_taken crate25)
	(is_type crate26 medicine_crate)
	(at crate26 depot)
	(can_be_taken crate26)
	(is_type crate27 medicine_crate)
	(at crate27 depot)
	(can_be_taken crate27)
	(is_type crate28 medicine_crate)
	(at crate28 depot)
	(can_be_taken crate28)
	(is_type crate29 medicine_crate)
	(at crate29 depot)
	(can_be_taken crate29)
	(is_type crate30 medicine_crate)
	(at crate30 depot)
	(can_be_taken crate30)
	(is_type crate31 medicine_crate)
	(at crate31 depot)
	(can_be_taken crate31)
	(is_type crate32 medicine_crate)
	(at crate32 depot)
	(can_be_taken crate32)
	(is_type crate33 medicine_crate)
	(at crate33 depot)
	(can_be_taken crate33)
	(is_type crate34 medicine_crate)
	(at crate34 depot)
	(can_be_taken crate34)
	(is_type crate35 medicine_crate)
	(at crate35 depot)
	(can_be_taken crate35)
	(is_type crate36 medicine_crate)
	(at crate36 depot)
	(can_be_taken crate36)
	(is_type crate37 medicine_crate)
	(at crate37 depot)
	(can_be_taken crate37)
	(is_type crate38 medicine_crate)
	(at crate38 depot)
	(can_be_taken crate38)
	(is_type crate39 medicine_crate)
	(at crate39 depot)
	(can_be_taken crate39)
	(is_type crate40 medicine_crate)
	(at crate40 depot)
	(can_be_taken crate40)
	(at helicopter1 depot)
	(empty helicopter1)
	(at person1 loc3)
	(at person2 loc3)
	(at person3 depot)
	(at person4 loc10)
	(at person5 loc6)
	(at person6 loc6)
	(at person7 loc6)
	(at person8 loc9)
	(at person9 loc5)
	(at person10 loc2)
	(at person11 loc2)
	(at person12 depot)
	(at person13 loc4)
	(at person14 loc3)
	(at person15 loc8)
	(at person16 loc6)
	(at person17 loc7)
	(at person18 loc9)
	(at person19 loc2)
	(at person20 depot)
	(at person21 loc1)
	(at person22 loc7)
	(at person23 loc7)
	(at person24 loc1)
	(at person25 loc7)
	(at person26 depot)
	(at person27 loc8)
	(at person28 loc1)
	(at person29 loc6)
	(at person30 loc8)
	(at person31 loc4)
	(at person32 loc9)
	(at person33 loc8)
	(at person34 loc8)
	(at person35 loc1)
	(at person36 loc5)
	(at person37 loc7)
	(at person38 loc3)
	(at person39 loc3)
	(at person40 loc6)
	(at person41 loc8)
	(at person42 loc6)
	(at person43 loc9)
	(at person44 loc4)
	(at person45 loc3)
	(at person46 loc4)
	(at person47 loc6)
	(at person48 loc2)
	(at person49 loc6)
	(at person50 loc10)
	(at carrier1  depot)
)
(:goal (and

	(at helicopter1 depot)
	(has_crate person1 food_crate)
	(has_crate person5 food_crate)
	(has_crate person16 food_crate)
	(has_crate person22 food_crate)
	(has_crate person31 food_crate)
	(has_crate person32 food_crate)
	(has_crate person38 food_crate)
	(has_crate person41 medicine_crate)
	(has_crate person43 medicine_crate)
	(has_crate person48 medicine_crate)
	))
)

; plan
1. (pick_up helicopter1 crate1 depot)
   deleted: (empty helicopter1) (can_be_taken crate1) (at crate1 depot)
   added: (contains helicopter1 crate1)
   goals met: 1 of 11
2. (move helicopter1 depot loc9)
   deleted: (at helicopter1 depot)
   added: (at helicopter1 loc9)
   goals met: 0 of 11
3. (give helicopter1 crate1 person32 loc9 food_crate)
   deleted: (contains helicopter1 crate1)
   added: (empty helicopter1) (can_be_taken crate1) (has_crate person32 food_crate)
   goals met: 1 of 11
4. (move helicopter1 loc9 depot)
   deleted: (at helicopter1 loc9)
   added: (at helicopter1 depot)
   goals met: 2 of 11
5. (pick_up helicopter1 crate2 depot)
   deleted: (empty helicopter1) (can_be_taken crate2) (at crate2 depot)
   added: (contains helicopter1 crate2)
   goals met: 2 of 11
6. (move helicopter1 depot loc7)
   deleted: (at helicopter1 depot)
   added: (at helicopter1 loc7)
   goals met: 1 of 11
7. (give helicopter1 crate2 person22 loc7 food_crate)
   deleted: (contains helicopter1 crate2)
   added: (empty helicopter1) (can_be_taken crate2) (has_crate person22 food_crate)
   goals met: 2 of 11
8. (move helicopter1 loc7 depot)
   deleted: (at helicopter1 loc7)
   added: (at helicopter1 depot)
   goals met: 3 of 11
9. (pick_up helicopter1 crate3 depot)
   deleted: (empty helicopter1) (can_be_taken crate3) (at crate3 depot)
   added: (contains helicopter1 crate3)
   goals met: 3 of 11
10. (move helicopter1 depot loc6)
   deleted: (at helicopter1 depot)
   added: (at helicopter1 loc6)
   goals met: 2 of 11
11. (give helicopter1 crate3 person16 loc6 food_crate)
   deleted: (contains helicopter1 crate3)
   added: (empty helicopter1) (can_be_taken crate3) (has_crate person16 food_crate)
   goals met: 3 of 11
12. (move helicopter1 loc6 depot)
   deleted: (at helicopter1 loc6)
   added: (at helicopter1 depot)
   goals met: 4 of 11
13. (pick_up helicopter1 crate4 depot)
   deleted: (empty helicopter1) (can_be_taken crate4) (at crate4 depot)
   added: (contains helicopter1 crate4)
   goals met: 4 of 11
14. (move helicopter1 depot loc6)
   deleted: (at helicopter1 depot)
   added: (at helicopter1 loc6)
   goals met: 3 of 11
15. (give helicopter1 crate4 person5 loc6 food_crate)
   deleted: (contains helicopter1 crate4)
   added: (empty helicopter1) (can_be_taken crate4) (has_crate person5 food_crate)
   goals met: 4 of 11
16. (move helicopter1 loc6 depot)
   deleted: (at helicopter1 loc6)
   added: (at helicopter1 depot)
   goals met: 5 of 11
17. (pick_up helicopter1 crate5 depot)
   deleted: (empty helicopter1) (can_be_taken crate5) (at crate5 depot)
   added: (contains helicopter1 crate5)
   goals met: 5 of 11
18. (move helicopter1 depot loc4)
   deleted: (at helicopter1 depot)
   added: (at helicopter1 loc4)
   goals met: 4 of 11
19. (give helicopter1 crate5 person31 loc4 food_crate)
   deleted: (contains helicopter1 crate5)
   added: (empty helicopter1) (can_be_taken crate5) (has_crate person31 food_crate)
   goals met: 5 of 11
20. (move helicopter1 loc4 depot)
   deleted: (at helicopter1 loc4)
   added: (at helicopter1 depot)
   goals met: 6 of 11
21. (pick_up helicopter1 crate6 depot)
   deleted: (empty helicopter1) (can_be_taken crate6) (at crate6 depot)
   added: (contains helicopter1 crate6)
   goals met: 6 of 11
22. (move helicopter1 depot loc3)
   deleted: (at helicopter1 depot)
   added: (at helicopter1 loc3)
   goals met: 5 of 11
23. (give helicopter1 crate6 person38 loc3 food_crate)
   deleted: (contains helicopter1 crate6)
   added: (empty helicopter1) (can_be_taken crate6) (has_crate person38 food_crate)
   goals met: 6 of 11
24. (move helicopter1 loc3 depot)
   deleted: (at helicopter1 loc3)
   added: (at helicopter1 depot)
   goals met: 7 of 11
25. (pick_up helicopter1 crate7 depot)
   deleted: (empty helicopter1) (can_be_taken crate7) (at crate7 depot)
   added: (contains helicopter1 crate7)
   goals met: 7 of 11
26. (move helicopter1 depot loc3)
   deleted: (at helicopter1 depot)
   added: (at helicopter1 loc3)
   goals met: 6 of 11
27. (give helicopter1 crate7 person1 loc3 food_crate)
   deleted: (contains helicopter1 crate7)
   added: (empty helicopter1) (can_be_taken crate7) (has_crate person1 food_crate)
   goals met: 7 of 11
28. (move helicopter1 loc3 depot)
   deleted: (at helicopter1 loc3)
   added: (at helicopter1 depot)
   goals met: 8 of 11
29. (pick_up helicopter1 crate13 depot)
   deleted: (empty helicopter1) (can_be_taken crate13) (at crate13 depot)
   added: (contains helicopter1 crate13)
   goals met: 8 of 11
30. (move helicopter1 depot loc9)
   deleted: (at helicopter1 depot)
   added: (at helicopter1 loc9)
   goals met: 7 of 11
31. (give helicopter1 crate13 person43 loc9 medicine_crate)
   deleted: (contains helicopter1 crate13)
   added: (empty helicopter1) (can_be_taken crate13) (has_crate person43 medicine_crate)
   goals met: 8 of 11
32. (move helicopter1 loc9 depot)
   deleted: (at helicopter1 loc9)
   added: (at helicopter1 depot)
   goals met: 9 of 11
33. (pick_up helicopter1 crate14 depot)
   deleted: (empty helicopter1) (can_be_taken crate14) (at crate14 depot)
   added: (contains helicopter1 crate14)
   goals met: 9 of 11
34. (move helicopter1 depot loc8)
   deleted: (at helicopter1 depot)
   added: (at helicopter1 loc8)
   goals met: 8 of 11
35. (give helicopter1 crate14 person41 loc8 medicine_crate)
   deleted: (contains helicopter1 crate14)
   added: (empty helicopter1) (can_be_taken crate14) (has_crate person41 medicine_crate)
   goals met: 9 of 11
36. (move helicopter1 loc8 depot)
   deleted: (at helicopter1 loc8)
   added: (at helicopter1 depot)
   goals met: 10 of 11
37. (pick_up helicopter1 crate15 depot)
   deleted: (empty helicopter1) (can_be_taken crate15) (at crate15 depot)
   added: (contains helicopter1 crate15)
   goals met: 10 of 11
38. (move helicopter1 depot loc2)
   deleted: (at helicopter1 depot)
   added: (at helicopter1 loc2)
   goals met: 9 of 11
39. (give helicopter1 crate15 person48 loc2 medicine_crate)
   deleted: (contains helicopter1 crate15)
   added: (empty helicopter1) (can_be_taken crate15) (has_crate person48 medicine_crate)
   goals met: 10 of 11
40. (move helicopter1 loc2 depot)
   deleted: (at helicopter1 loc2)
   added: (at helicopter1 depot)
   goals met: 11 of 11
